In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [3]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [4]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [5]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [6]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [7]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [8]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [9]:
ser['Hud']

4

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.143978  2.603804 -0.577310  2.041430 -1.721288
B  0.210252  1.148249 -0.169754 -1.224355  0.040497
C  0.370206 -0.686600  0.579523  0.068523  0.949729
D -0.370679  1.360387  0.361109  0.825760 -0.009570
E -0.815109  2.188965  1.284986 -0.135241  0.469877

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [20]:
df

          W         X         Y         Z       new
A -1.143978  2.603804 -0.577310  2.041430 -1.721288
B  0.210252  1.148249 -0.169754 -1.224355  0.040497
C  0.370206 -0.686600  0.579523  0.068523  0.949729
D -0.370679  1.360387  0.361109  0.825760 -0.009570
E -0.815109  2.188965  1.284986 -0.135241  0.469877

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [23]:
df.drop('C',axis=0)

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [24]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [25]:
# df.loc?

In [26]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [27]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.loc['A']

W   -1.143978
X    2.603804
Y   -0.577310
Z    2.041430
Name: A, dtype: float64

In [29]:
df.loc['B','Y']

-0.1697543135238731

In [30]:
df.loc[['A','B'],['W']]

          W
A -1.143978
B  0.210252

In [31]:
df.loc['A':'D','W':'Y']

          W         X         Y
A -1.143978  2.603804 -0.577310
B  0.210252  1.148249 -0.169754
C  0.370206 -0.686600  0.579523
D -0.370679  1.360387  0.361109

In [32]:
df.loc[df.W>0,:]

          W         X         Y         Z
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523

In [33]:
df.loc[:,'Y']

A   -0.577310
B   -0.169754
C    0.579523
D    0.361109
E    1.284986
Name: Y, dtype: float64

In [34]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [35]:
df.iloc[2]

W    0.370206
X   -0.686600
Y    0.579523
Z    0.068523
Name: C, dtype: float64

In [36]:
df.iloc[[2,4],1]

C   -0.686600
E    2.188965
Name: X, dtype: float64

In [37]:
list(df.W >0)

[False, True, True, False, False]

In [38]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523

In [39]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True   True  False  False
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [42]:
df[df>0]

          W         X         Y         Z
A       NaN  2.603804       NaN  2.041430
B  0.210252  1.148249       NaN       NaN
C  0.370206       NaN  0.579523  0.068523
D       NaN  1.360387  0.361109  0.825760
E       NaN  2.188965  1.284986       NaN

In [43]:
df[df['W']>0]

          W         X         Y         Z
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523

In [44]:
df

          W         X         Y         Z
A -1.143978  2.603804 -0.577310  2.041430
B  0.210252  1.148249 -0.169754 -1.224355
C  0.370206 -0.686600  0.579523  0.068523
D -0.370679  1.360387  0.361109  0.825760
E -0.815109  2.188965  1.284986 -0.135241

In [45]:
df[df['W']>0]['Y']

B   -0.169754
C    0.579523
Name: Y, dtype: float64

In [46]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.169754  1.148249
C  0.579523 -0.686600

In [47]:
df[(df['W']>0) & (df['Y'] <0)]

          W         X         Y         Z
B  0.210252  1.148249 -0.169754 -1.224355